2025/e03/r/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ro" xml:lang="ro">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lucrul cu formularele</title>
<meta name="author" content="Petru Rebeja" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lucrul cu formularele</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Cuprins</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org20d6d46">Resurse</a>
<ul>
<li><a href="#org6fc00a0">index.php</a></li>
<li><a href="#org7108c9d">register-feedback.php</a></li>
<li><a href="#orga27ec85">styles.css</a></li>
</ul>
</li>
<li><a href="#org3764f31">Instrucțiuni Docker</a></li>
</ul>
</div>
</div>

<div id="outline-container-org20d6d46" class="outline-2">
<h2 id="org20d6d46">Resurse</h2>
<div class="outline-text-2" id="text-org20d6d46">
</div>
<div id="outline-container-org6fc00a0" class="outline-3">
<h3 id="org6fc00a0">index.php</h3>
<div class="outline-text-3" id="text-org6fc00a0">
<div class="org-src-container">
<pre class="src src-php"><span style="color: #b294bb;">&lt;?php</span>
session_start();
<span style="color: #b294bb;">?&gt;</span>
&lt;!<span style="color: #81a2be;">DOCTYPE</span> html&gt;
&lt;html lang=<span style="color: #8abeb7;">"ro"</span>&gt;
&lt;head&gt;
    &lt;meta charset=<span style="color: #8abeb7;">"UTF-8"</span>&gt;
    &lt;meta name=<span style="color: #8abeb7;">"viewport"</span> content=<span style="color: #8abeb7;">"width=device-width, initial-scale=1.0"</span>&gt;
    &lt;title&gt;Oale &#537;i ulcele&lt;/title&gt;
    &lt;link rel=<span style="color: #8abeb7;">"stylesheet"</span> href=<span style="color: #8abeb7;">"styles.css"</span>&gt;
&lt;/head&gt;
&lt;body&gt;
    &lt;header&gt;
        &lt;nav&gt;
            &lt;ul&gt;
                &lt;li&gt;&lt;a href=<span style="color: #8abeb7;">"#"</span>&gt;Pagina principal&#259;&lt;/a&gt;&lt;/li&gt;
                &lt;li&gt;&lt;a href=<span style="color: #8abeb7;">"#"</span>&gt;Despre noi&lt;/a&gt;&lt;/li&gt;
                &lt;li&gt;&lt;a href=<span style="color: #8abeb7;">"#"</span>&gt;Servicii&lt;/a&gt;&lt;/li&gt;
                &lt;li&gt;&lt;a href=<span style="color: #8abeb7;">"#"</span>&gt;Contact&lt;/a&gt;&lt;/li&gt;
            &lt;/ul&gt;
        &lt;/nav&gt;
    &lt;/header&gt;

    &lt;main&gt;
<span style="color: #b294bb;">     &lt;?php</span>
     <span style="color: #b5bd68;">if</span> (<span style="color: #b5bd68;">isset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'success_msg'</span>])) {
         <span style="color: #b5bd68;">echo</span> <span style="color: #8abeb7;">"&lt;div class='success-msg'&gt;</span><span style="color: #f0c674;">{$_SESSION['success_msg']}</span><span style="color: #8abeb7;">&lt;/div&gt;"</span>;
         <span style="color: #b5bd68;">unset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'success_msg'</span>]);
     }
     <span style="color: #b294bb;">?&gt;</span>
     &lt;form action=<span style="color: #8abeb7;">"register-feedback.php"</span> method=<span style="color: #8abeb7;">"post"</span>&gt;
       &lt;h1&gt;Feedback&lt;/h1&gt;
       &lt;div&gt;
         &lt;label <span style="color: #b5bd68;">for</span>=<span style="color: #8abeb7;">"name"</span>&gt;Nume:&lt;/label&gt;
         &lt;input type=<span style="color: #8abeb7;">"text"</span> id=<span style="color: #8abeb7;">"name"</span> name=<span style="color: #8abeb7;">"name"</span> required placeholder=<span style="color: #8abeb7;">"Introduce&#539;i numele"</span> value=<span style="color: #8abeb7;">"&lt;?php echo isset(</span><span style="color: #f0c674;">$_SESSION</span><span style="color: #8abeb7;">['name'])?</span><span style="color: #f0c674;">$_SESSION</span><span style="color: #8abeb7;">['name']:'' ?&gt;"</span>&gt;&lt;/input&gt;
         &lt;span <span style="color: #b5bd68;">class</span>=<span style="color: #8abeb7;">"error"</span>&gt;<span style="color: #b294bb;">&lt;?php</span> <span style="color: #b5bd68;">echo</span> <span style="color: #b5bd68;">isset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'name_error'</span>])?$<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'name_error'</span>]:<span style="color: #8abeb7;">''</span> <span style="color: #b294bb;">?&gt;</span>&lt;/span&gt;
       &lt;/div&gt;
       &lt;div&gt;
         &lt;label <span style="color: #b5bd68;">for</span>=<span style="color: #8abeb7;">"feedback"</span>&gt;Mesaj:&lt;/label&gt;
         &lt;textarea id=<span style="color: #8abeb7;">"feedback"</span> name=<span style="color: #8abeb7;">"feedback"</span> required rows=<span style="color: #8abeb7;">"10"</span> cols=<span style="color: #8abeb7;">"50"</span>&gt;<span style="color: #b294bb;">&lt;?php</span> <span style="color: #b5bd68;">echo</span> <span style="color: #b5bd68;">isset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback'</span>])?$<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback'</span>]:<span style="color: #8abeb7;">''</span> <span style="color: #b294bb;">?&gt;</span>&lt;/textarea&gt;
         &lt;span <span style="color: #b5bd68;">class</span>=<span style="color: #8abeb7;">"error"</span>&gt;<span style="color: #b294bb;">&lt;?php</span> <span style="color: #b5bd68;">echo</span> <span style="color: #b5bd68;">isset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback_error'</span>])?$<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback_error'</span>]:<span style="color: #8abeb7;">''</span> <span style="color: #b294bb;">?&gt;</span>&lt;/span&gt;
       &lt;/div&gt;
       &lt;div&gt;
         &lt;button type=<span style="color: #8abeb7;">"submit"</span>&gt;Trimite feedback&lt;/button&gt;
       &lt;/div&gt;
      &lt;/form&gt;
    &lt;/main&gt;
    &lt;footer&gt;
        &lt;p&gt;Contact us at: deschide@oalesiulcele.ro&lt;/p&gt;
    &lt;/footer&gt;
&lt;/body&gt;
&lt;/html&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org7108c9d" class="outline-3">
<h3 id="org7108c9d">register-feedback.php</h3>
<div class="outline-text-3" id="text-org7108c9d">
<div class="org-src-container">
<pre class="src src-php"><span style="color: #b294bb;">&lt;?php</span>
session_start();

<span style="color: #b5bd68;">function</span> <span style="color: #de935f;">validate_name</span>(<span style="color: #81a2be;">string</span> $<span style="color: #f0c674;">name</span>, <span style="color: #81a2be;">int</span> $<span style="color: #f0c674;">min_length</span>=1, <span style="color: #81a2be;">int</span> $<span style="color: #f0c674;">max_length</span>=<span style="color: #81a2be;">INF</span>) : <span style="color: #81a2be;">string</span>
{
    $<span style="color: #f0c674;">name</span> = htmlspecialchars(trim($<span style="color: #f0c674;">name</span>));
    $<span style="color: #f0c674;">name_len</span> = strlen($<span style="color: #f0c674;">name</span>);

    <span style="color: #b5bd68;">if</span> ($<span style="color: #f0c674;">name_len</span> &lt; $<span style="color: #f0c674;">min_length</span>) {
        <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">"Numele trebuie s&#259; fie alc&#259;tuit din minim </span><span style="color: #f0c674;">{$min_length}</span><span style="color: #8abeb7;"> caractere"</span>;
    }

    <span style="color: #b5bd68;">if</span> ($<span style="color: #f0c674;">name_len</span> &gt; $<span style="color: #f0c674;">max_length</span> &amp;&amp; $<span style="color: #f0c674;">max_length</span> &lt; <span style="color: #81a2be;">INF</span>) {
        <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">"Numele trebuie s&#259; fie alc&#259;tuit din maxim </span><span style="color: #f0c674;">{$max_length}</span><span style="color: #8abeb7;"> caractere"</span>;
    }

    <span style="color: #b5bd68;">if</span> (!preg_match(<span style="color: #8abeb7;">"/^[a-zA-Z-' ]*$/"</span>,$<span style="color: #f0c674;">name</span>)) {
        <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">"Numere trebuie s&#259; con&#539;in&#259; doar litere, spa&#539;ii &#537;i cratime."</span>;
    }
    <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">""</span>;
}

<span style="color: #b5bd68;">function</span> <span style="color: #de935f;">validate_feedback</span>(<span style="color: #81a2be;">string</span> $<span style="color: #f0c674;">feedback</span>, <span style="color: #81a2be;">int</span> $<span style="color: #f0c674;">min_length</span>=1, <span style="color: #81a2be;">int</span> $<span style="color: #f0c674;">max_length</span>=<span style="color: #81a2be;">INF</span>) : <span style="color: #81a2be;">string</span>
{
    $<span style="color: #f0c674;">feedback</span> = htmlspecialchars(trim($<span style="color: #f0c674;">feedback</span>));
    $<span style="color: #f0c674;">len</span> = strlen($<span style="color: #f0c674;">feedback</span>);

    <span style="color: #b5bd68;">if</span> ($<span style="color: #f0c674;">len</span> &lt; $<span style="color: #f0c674;">min_length</span>) {
        <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">"Mesajul trebuie s&#259; fie alc&#259;tuit din minim </span><span style="color: #f0c674;">{$min_length}</span><span style="color: #8abeb7;"> caractere"</span>;
    }

    <span style="color: #b5bd68;">if</span> ($<span style="color: #f0c674;">len</span> &gt; $<span style="color: #f0c674;">max_length</span> &amp;&amp; $<span style="color: #f0c674;">max_length</span> &lt; <span style="color: #81a2be;">INF</span>) {
        <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">"Mesajul trebuie s&#259; fie alc&#259;tuit din maxim </span><span style="color: #f0c674;">{$max_length}</span><span style="color: #8abeb7;"> caractere"</span>;
    }

    <span style="color: #b5bd68;">return</span> <span style="color: #8abeb7;">""</span>;
}

$<span style="color: #f0c674;">name</span> = $<span style="color: #f0c674;">_POST</span>[<span style="color: #8abeb7;">'name'</span>];
$<span style="color: #f0c674;">msg</span> = $<span style="color: #f0c674;">_POST</span>[<span style="color: #8abeb7;">'feedback'</span>];
$<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'name'</span>] = $<span style="color: #f0c674;">name</span>;
$<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback'</span>] = $<span style="color: #f0c674;">msg</span>;

<span style="color: #b5bd68;">unset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'name_error'</span>]);
<span style="color: #b5bd68;">unset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback_error'</span>]);

$<span style="color: #f0c674;">err</span> = validate_name($<span style="color: #f0c674;">name</span>, 1, 100);
<span style="color: #b5bd68;">if</span> (strlen($<span style="color: #f0c674;">err</span>)&gt;0) {
    $<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'name_error'</span>] = $<span style="color: #f0c674;">err</span>;
}

$<span style="color: #f0c674;">err</span> = validate_feedback($<span style="color: #f0c674;">msg</span>, max_length:512);
<span style="color: #b5bd68;">if</span> (strlen($<span style="color: #f0c674;">err</span>)&gt;0) {
    $<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback_error'</span>] = $<span style="color: #f0c674;">err</span>;
}

<span style="color: #b5bd68;">if</span> (!<span style="color: #b5bd68;">isset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'name_error'</span>]) &amp;&amp; !<span style="color: #b5bd68;">isset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback_error'</span>])) {
    $<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'success_msg'</span>] = <span style="color: #8abeb7;">"Mesajul a fost &#238;nregistrat. V&#259; mul&#539;umim!"</span>;
    <span style="color: #b5bd68;">unset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'name'</span>]);
    <span style="color: #b5bd68;">unset</span>($<span style="color: #f0c674;">_SESSION</span>[<span style="color: #8abeb7;">'feedback'</span>]);
}

header(<span style="color: #8abeb7;">"Location: index.php"</span>);
<span style="color: #b294bb;">?&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga27ec85" class="outline-3">
<h3 id="orga27ec85">styles.css</h3>
<div class="outline-text-3" id="text-orga27ec85">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #de935f;">*</span> {
    <span style="color: #b5bd68;">margin</span>: 0;
    <span style="color: #b5bd68;">padding</span>: 0;
    <span style="color: #b5bd68;">box-sizing</span>: border-box;
}

<span style="color: #de935f;">body</span> {
    <span style="color: #b5bd68;">font-family</span>: Arial, sans-serif;
    <span style="color: #b5bd68;">line-height</span>: 1.6;
}

<span style="color: #de935f;">header</span> {
    <span style="color: #b5bd68;">background-color</span>: <span style="color: #000000; background-color: #00ccff;">#00ccff</span>;
    <span style="color: #b5bd68;">color</span>: <span style="color: #000000; background-color: #fff;">#fff</span>;
    <span style="color: #b5bd68;">padding</span>: 1rem 0;
}

<span style="color: #de935f;">nav ul</span> {
    <span style="color: #b5bd68;">list-style</span>: none;
    <span style="color: #b5bd68;">display</span>: flex;
    <span style="color: #b5bd68;">justify-content</span>: center;
}

<span style="color: #de935f;">nav ul li</span> {
    <span style="color: #b5bd68;">margin</span>: 0 1rem;
}

<span style="color: #de935f;">nav ul li a</span> {
    <span style="color: #b5bd68;">color</span>: <span style="color: #000000; background-color: #ffffff;">#ffffff</span>;
    <span style="color: #b5bd68;">text-decoration</span>: none;
}

<span style="color: #de935f;">form h1</span> {
    <span style="color: #b5bd68;">margin-block</span>: 0.67em;
    <span style="color: #b5bd68;">font-size</span>: 2em;
    <span style="color: #b5bd68;">text-align</span>: center;
}

<span style="color: #de935f;">form &gt; div</span> {
    <span style="color: #b5bd68;">display</span>: flex;
    <span style="color: #b5bd68;">flex-direction</span>: column;
    <span style="color: #b5bd68;">padding</span>: 1rem 2rem;
}

<span style="color: #de935f;">.success-msg</span>{
    <span style="color: #b5bd68;">text-align</span>: center;
    <span style="color: #b5bd68;">background-color</span>: <span style="color: #ffffff; background-color: #2e8b57;">seagreen</span>;
    <span style="color: #b5bd68;">color</span>: <span style="color: #000000; background-color: #faebd7;">antiquewhite</span>;
    <span style="color: #b5bd68;">padding</span>: 15px 0px;
    <span style="color: #b5bd68;">margin</span>: 15px 30px;
}

<span style="color: #de935f;">span.error</span>{
    <span style="color: #b5bd68;">color</span>:<span style="color: #ffffff; background-color: #cd5c5c;">indianred</span>;
    <span style="color: #b5bd68;">font-size</span>: smaller;
}

<span style="color: #de935f;">.cards</span> {
    <span style="color: #b5bd68;">display</span>: flex;
    <span style="color: #b5bd68;">flex-wrap</span>: wrap;
    <span style="color: #b5bd68;">justify-content</span>: center;
    <span style="color: #b5bd68;">gap</span>: 1rem;
    <span style="color: #b5bd68;">padding</span>: 2rem 1rem;
}

<span style="color: #de935f;">.card</span> {
    <span style="color: #b5bd68;">border</span>: 1px solid <span style="color: #000000; background-color: #ddd;">#ddd</span>;
    <span style="color: #b5bd68;">border-radius</span>: 8px;
    <span style="color: #b5bd68;">overflow</span>: hidden;
    <span style="color: #b5bd68;">width</span>: 300px;
    <span style="color: #b5bd68;">box-shadow</span>: 0 4px 8px <span style="color: #ffffff; background-color: #000000;">rgba(0, 0, 0, 0.1)</span>;
}

<span style="color: #de935f;">.card img</span> {
    <span style="color: #b5bd68;">width</span>: 100%;
    <span style="color: #b5bd68;">height</span>: auto;
}

<span style="color: #de935f;">.card h2, .card p</span> {
    <span style="color: #b5bd68;">padding</span>: 1rem;
}

<span style="color: #de935f;">footer</span> {
    <span style="color: #b5bd68;">background-color</span>: <span style="color: #000000; background-color: #00ccff;">#00ccff</span>;
    <span style="color: #b5bd68;">color</span>: <span style="color: #000000; background-color: #fff;">#fff</span>;
    <span style="color: #b5bd68;">text-align</span>: center;
    <span style="color: #b5bd68;">padding</span>: 1rem 0;
}

<span style="color: #b294bb;">@media</span> screen and (max-width: 449px){
    <span style="color: #de935f;">nav ul</span> {
        <span style="color: #b5bd68;">flex-direction</span>: column;
        <span style="color: #b5bd68;">text-align</span>: center;
    }
}

<span style="color: #b294bb;">@media</span> screen and (min-width: 768px){
    <span style="color: #de935f;">.cards</span> {
        <span style="color: #b5bd68;">flex-direction</span>: row;
        <span style="color: #b5bd68;">align-items</span>: center;
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3764f31" class="outline-2">
<h2 id="org3764f31">Instrucțiuni Docker</h2>
<div class="outline-text-2" id="text-org3764f31">
<p>
Pentru a rula codul folosind o imagine <code>Docker</code>, mai întâi navigați în directorul în care ați salvat fișierele de mai sus și rulați comanda următoare:
</p>

<div class="org-src-container">
<pre class="src src-shell">docker run -d -p 8081:80 --name lab-tw -v <span style="color: #8abeb7;">"$PWD"</span>:/var/www/html php:8.2-apache
</pre>
</div>

<p>
La sfârșit, opriți containerul folosind comanda = docker stop lab-tw=. Pentru a elimina containerul executați comanda <code>docker rm lab-tw</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Petru Rebeja</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
